{
  "existe_empenho"                     : "O cancelamento do fechamento da folha não pode ser realizado, pois a mesma já possui empenho gerado.",
  "fechamento_folha_fechada"           : "Folha já encontra-se fechada.",
  "sem_registro_ponto"                 : "Folha não possui nenhum registro no ponto.",
  "folha_informada_fechada"            : "O cancelamento da abertura da folha não pode ser realizado se a mesma não encontra-se aberta.",
  "erro_excluir"                       : "Erro ao excluir da tabela folha pagamento.",
  "folha_informada_aberta"             : "O cancelamento do fechamento da folha não pode ser realizado pois a mesma encontra-se aberta.",
  "erro_instanciar_objeto"             : "Folha de pagamento incorreta.",
  "erro_procurar_registro"             : "Ocorreu um erro ao procurar se existe algum registro.",
  "codigo_folha_incorreto"             : "Não existe folha com o código informado([iCodigo]).",
  "inconsistencia_tipo"                : "Não é possível obter dados da folha de [sTipoEsperado] com um código de folha de [sTipoInformado].",
  "existe_folha_aberta"                : "O cancelamento do fechamento da folha não pode ser realizado pois a folha complementar nº: [icodigo], encontra-se aberta.",
  "erro_cancelar_fechamento"           : "Ocorreu um erro ao cancelar o fechamento da folha.",
  "erro_procurar_folha_aberta"         : "Ocorreu um erro ao procurar se existe uma folha aberta.",
  "erro_buscar_dados_folha_aberta"     : "Erro ao buscar os dados da folha aberta.",
  "folha_aberta_sem_registros"         : "Não foi possível encontrar folha de pagamento aberta.",
  "error_retornar_proximo_numero"      : "Não foi possível retornar o próximo número da folha.",
  "erro_salvar_historico_calculo"      : "Ocorreu um erro ao salvar o histórico do cálculo.",
  "erro_salvar_historico_ponto"        : "Ocorreu um erro ao salvar o histórico do ponto.",
  "erro_excluir_historico_calculo"     : "Não foi possível excluir o histórico do cálculo.",
  "erro_excluir_historico_ponto"       : "Não foi possível excluir o histórico do ponto.",
  "erro_consulta_historico_ponto"      : "Não foi possível consultar o histórico do ponto.",
  "erro_consulta_historico_calculo"    : "Não foi possível consultar o histórico do cálculo.",
  "sem_registro_historico_ponto"       : "Não retornou nenhum registro no histórico do ponto.",
  "erro_buscar_dados_eventos_folha"    : "Não foi possível retornar os eventos financeiros da folha.",
  "folha_complementar_aberta"          : "Não foi possível fechar a folha salário, pois existe uma complementar aberta.",
  "ponto_nao_inicializado"             : "Inicialize o ponto para realizar esta operação.",
  "erro_buscar_folhapagamento"         : "Erro ao buscar dados da folha de pagamento",
  "nenhuma_folha_aberta"               : "Nenhuma folha aberta",
  "erro_retornar_folha_servidor"       : "Não foi possível retornar a(s) folha(s) de pagamento do servidor.",
  "erro_criar_wgerfsal"                : "Erro ao criar tabela w_gerfsal",
  "erro_excluir_folhapagamentogeracao" : "Erro possível excluir os dados da tabela folhapagamentogeracao",
  "erro_excluir_historicopensao"       : "Erro ao excluir dados do histórico de pensões"
}
